In [1]:

import os


import findspark
findspark.init()

import pyspark
from pyspark.sql import SparkSession
from pyspark.sql import *
from pyspark.sql.functions import *
from pyspark.sql.types import *
import sys

os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

In [2]:
spark = SparkSession.builder.master("local[*]") \
    .appName("testing") \
    .config("spark.driver.extraClassPath", "C:\\my_sql_jar\\mysql-connector-java-8.0.26.jar") \
    .getOrCreate()
print(spark)

<pyspark.sql.session.SparkSession object at 0x00000249FD13C6D0>

In [4]:
my_data=[(10 ,'Anil',50000, 18),
(11 ,'Vikas',75000,  16),
(12 ,'Nisha',40000,  18),
(13 ,'Nidhi',60000,  17),
(14 ,'Priya',80000,  18),
(15 ,'Mohit',45000,  18),
(16 ,'Rajesh',90000, 10),
(17 ,'Raman',55000, 16),
(18 ,'Sam',65000,   17)]

In [5]:
my_schema = ['id', 'name', 'salary', 'mngr_id']

In [6]:
manager_df = spark.createDataFrame(data = my_data, schema = my_schema)

In [7]:
manager_df.show()

+---+------+------+-------+
| id|  name|salary|mngr_id|
+---+------+------+-------+
| 10|  Anil| 50000|     18|
| 11| Vikas| 75000|     16|
| 12| Nisha| 40000|     18|
| 13| Nidhi| 60000|     17|
| 14| Priya| 80000|     18|
| 15| Mohit| 45000|     18|
| 16|Rajesh| 90000|     10|
| 17| Raman| 55000|     16|
| 18|   Sam| 65000|     17|
+---+------+------+-------+

In [8]:
# checking count of manager_df
manager_df.count()

9

In [9]:
# creating new df

my_data1=[(19 ,'Sohan',50000, 18),
(20 ,'Sima',75000,  17)]

my_schema1 = ['id', 'name', 'salary', 'mngr_id']

manager_df1 = spark.createDataFrame(data = my_data1, schema = my_schema1)

In [10]:
manager_df1.show()

+---+-----+------+-------+
| id| name|salary|mngr_id|
+---+-----+------+-------+
| 19|Sohan| 50000|     18|
| 20| Sima| 75000|     17|
+---+-----+------+-------+

In [11]:
# checking count of manager_df1
manager_df1.count()

2

In [12]:
manager_df.union(manager_df1).show()

+---+------+------+-------+
| id|  name|salary|mngr_id|
+---+------+------+-------+
| 10|  Anil| 50000|     18|
| 11| Vikas| 75000|     16|
| 12| Nisha| 40000|     18|
| 13| Nidhi| 60000|     17|
| 14| Priya| 80000|     18|
| 15| Mohit| 45000|     18|
| 16|Rajesh| 90000|     10|
| 17| Raman| 55000|     16|
| 18|   Sam| 65000|     17|
| 19| Sohan| 50000|     18|
| 20|  Sima| 75000|     17|
+---+------+------+-------+

In [14]:
# checking count of union of 2 df
manager_df.union(manager_df1).count()

11

In [15]:
# inserting 3 records named 'Sam'
my_data2=[(10 ,'Anil',50000, 18),
(11 ,'Vikas',75000,  16),
(12 ,'Nisha',40000,  18),
(13 ,'Nidhi',60000,  17),
(14 ,'Priya',80000,  18),
(15 ,'Mohit',45000,  18),
(16 ,'Rajesh',90000, 10),
(17 ,'Raman',55000, 16),
(18 ,'Sam',65000,   17),
(18 ,'Sam',55000,   17),
(18 ,'Sam',65000,   17)]

my_schema2 = ['id', 'name', 'salary', 'mngr_id']

dups_df = spark.createDataFrame(data = my_data2, schema = my_schema2)

In [16]:
dups_df.show()

+---+------+------+-------+
| id|  name|salary|mngr_id|
+---+------+------+-------+
| 10|  Anil| 50000|     18|
| 11| Vikas| 75000|     16|
| 12| Nisha| 40000|     18|
| 13| Nidhi| 60000|     17|
| 14| Priya| 80000|     18|
| 15| Mohit| 45000|     18|
| 16|Rajesh| 90000|     10|
| 17| Raman| 55000|     16|
| 18|   Sam| 65000|     17|
| 18|   Sam| 55000|     17|
| 18|   Sam| 65000|     17|
+---+------+------+-------+

In [18]:
dups_df.count()

11

In [20]:
## union and union all difference in df
# manager_df - count = 9
# dups_df - count = 11
# UNION

manager_df.union(dups_df).count()

20

In [21]:
# UNION ALL

manager_df.unionAll(dups_df).count()

20

In [22]:
# to use in spark sql view/table needs to be created

manager_df.createOrReplaceTempView("manager_df_tbl")
dups_df.createOrReplaceTempView("dups_df_tbl")

In [23]:
# UNION in spark sql
spark.sql("""
select * from manager_df_tbl
union 
select * from dups_df_tbl
""").count()

10

In [25]:
# UNION in spark sql
spark.sql("""
select * from manager_df_tbl
union 
select * from dups_df_tbl
""").show()

+---+------+------+-------+
| id|  name|salary|mngr_id|
+---+------+------+-------+
| 10|  Anil| 50000|     18|
| 11| Vikas| 75000|     16|
| 12| Nisha| 40000|     18|
| 13| Nidhi| 60000|     17|
| 15| Mohit| 45000|     18|
| 14| Priya| 80000|     18|
| 16|Rajesh| 90000|     10|
| 18|   Sam| 65000|     17|
| 17| Raman| 55000|     16|
| 18|   Sam| 55000|     17|
+---+------+------+-------+

In [24]:
# UNION ALL in spark sql
spark.sql("""
select * from manager_df_tbl
union all
select * from dups_df_tbl
""").count()

20

In [26]:
# UNION ALL in spark sql
spark.sql("""
select * from manager_df_tbl
union all
select * from dups_df_tbl
""").show()

+---+------+------+-------+
| id|  name|salary|mngr_id|
+---+------+------+-------+
| 10|  Anil| 50000|     18|
| 11| Vikas| 75000|     16|
| 12| Nisha| 40000|     18|
| 13| Nidhi| 60000|     17|
| 14| Priya| 80000|     18|
| 15| Mohit| 45000|     18|
| 16|Rajesh| 90000|     10|
| 17| Raman| 55000|     16|
| 18|   Sam| 65000|     17|
| 10|  Anil| 50000|     18|
| 11| Vikas| 75000|     16|
| 12| Nisha| 40000|     18|
| 13| Nidhi| 60000|     17|
| 14| Priya| 80000|     18|
| 15| Mohit| 45000|     18|
| 16|Rajesh| 90000|     10|
| 17| Raman| 55000|     16|
| 18|   Sam| 65000|     17|
| 18|   Sam| 55000|     17|
| 18|   Sam| 65000|     17|
+---+------+------+-------+

### Note: in the dataframe there's no difference between UNION and UNION ALL but if we're using in spark sql or sql, UNION results in unique records of both the dataframe and UNION ALL  results in all the records of both the df